---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataMaterialDescription
source: html/6e33521d-15c3-2f54-b7df-2d42b6285ba3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataMaterialDescription Property

"Product Material Description"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationProductDataMaterialDescription { get; }
```